Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetDefaultPositiveDirectionForMorphedTargetEdgesHandle(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Structure.TargetRebarEdge,System.Int32)
Gets the default positive direction of the specified target rebar edge in terms of how Morphed Free Form Rebar is defining the default positive direction.
document:
The document that contains the target rebar.
targetRebarEdge:
The target rebar edge for which it will get the default positive direction.
barIndex:
The index of the bar in the target set. Should be between 0 and NumberOfBars() - 1.
Returns:
Returns the default positive direction of the specified target rebar edge.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The target rebar should be a valid Rebar Target and bar index should be between 0 and NumberOfBars() - 1.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.Flip3dPathSet
For a free form set distributed along a 3D path, this method flips the distribution path. The set should not have Single layout rule.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar is not created with the 3D Path Free Form rebar server.
-or-
Rebar has Single layout rule.
Since:
2027

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.IsValidRebarTargetForMorphedRebar(Autodesk.Revit.DB.Structure.Rebar)
Checks if the rebar can be used as a target for morphed rebar.
A rebar is a valid target for morphed rebar if all the bars in set have the same number of segments and all are planar.
Multiplanar bars are considered invalid.
rebarTarget:
The rebar that will be tested.
Returns:
Return true if the rebar is a valid target for morphed rebar, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetComputationDataFor3DPathSet
For a free form set distributed along a 3D path, this method gets the computation data.
Returns:
Returns the computation data.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar is not created with the 3D Path Free Form rebar server.
Since:
2027

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetComputationDataFor3DPathSet(Autodesk.Revit.DB.Structure.ComputationDataFor3DPathSet)
For a free form set distributed along a 3D path, this method sets the computation data.
computationData:
The computation data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar is not created with the 3D Path Free Form rebar server.
Since:
2027

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetReportedShape(Autodesk.Revit.DB.ElementId)
This method changes the RebarShape of a Free Form Rebar that is using RebarWorkInstructions.Straight property to the provided RebarShape.
Remarks:
The Rebar element RebarWorkInstructions property should be Straight.
The rebarShapeId parameter should be the id of a straight RebarShape (single straight segment, no RebarHookType, no EndTreatmentType, no Crank).
Moreover the straight RebarShape RebarStyle should match ( if the current RebarShape RebarStyle is Standard then the RebarShape cannot be changed to a straigh RebarShape using the RebarStyle Stirrup/Tie ).
If current RebarShape and the provided rebarShapeId has Stirrup/Tie RebarStyle then also the StirrupTieAttachmentType should match ( both InteriorFace or ExteriorFace ).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShapeId cannot be set as a reporting RebarShape for this Rebar element.
Since:
2022

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.CanBeTerminationPlaneNormal(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
A vector can be termination (e.g. hook, crank) plane normal if for a bar specified by index, the bar direction is not parallel with the vector.
Remarks:
This method does not take into account the rotation of the bar relative to its default position along the distribution path.
barIndex:
The index of bar for which it will try to see if termination plane normal is applicable.
end:
The end of bar. Should be 0 for start, 1 for end.
normal:
The termination's plane normal that will be tested.
Returns:
A vector can be termination (e.g. hook, crank) plane normal if for a bar specified by index, the bar direction is not parallel with the vector.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
Invalid end.
Since:
2026

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetTerminationPlaneNormalForBarIndex(System.Int32,System.Int32)
Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay.
Remarks:
This method does not take into account the rotation of the bar relative to its default position along the distribution path.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Returns:
Returns the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
Invalid end.
Since:
2026

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetTerminationPlaneNormalForBarIndex(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay.
Will throw exception if the rebar has valid constraints.
Remarks:
This method does not take into account the rotation of the bar relative to its default position along the distribution path.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
terminationPlaneNormal:
The plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay.
The normal should be perpendicular to the bar direction at the specified end of bar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Normal terminationPlaneNormal for end end isn't a valid normal for bar with index barPositionIndex
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
-or-
Invalid end.
-or-
terminationPlaneNormal has zero length.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor Rebar is constrained.
Since:
2026

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.HasValidMorphedServer
Returns true if the current rebar is created with the Morphed Free Form rebar server, false otherwise.
Returns:
Returns true if the current rebar is created with the Morphed Free Form rebar server, false otherwise.
Since:
2027

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.HasValid3DPathServer
Returns true if the current rebar is created with the 3D Path Free Form rebar server, false otherwise.
Returns:
Returns true if the current rebar is created with the 3D Path Free Form rebar server, false otherwise.
Since:
2027

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.HasValidSurfaceServer
Returns true if the current rebar is created with the Surface Free Form rebar server, false otherwise.
Returns:
Returns true if the current rebar is created with the Surface Free Form rebar server, false otherwise.
Since:
2027

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetTerminationOrientationAtIndex(System.Int32,System.Int32)
Gets the termination's (e.g. hook, crank ) orientation that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetTerminationOrientation(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetTerminationOrientation(int end).All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetTerminationOrientation(int end).Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the termination's (hook, crank) orientation at the opposite end. For the others bars will return the same as Rebar.GetTerminationOrientation(int end).
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
end:
0 for the start termination, 1 for the end termination.
Returns:
Returns the termination (e.g. hook, crank) orientation at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2026

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetTerminationRotationAngleAtIndex(System.Int32,System.Int32)
Gets the termination (e.g hook,crank) rotation angle that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetTerminationRotationAngle(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetTerminationRotationAngle(int end).All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetTerminationRotationAngle(int end).Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the termination rotation angle at the opposite end. For the others bars will return the same as Rebar.GetTerminationRotationAngle(int end).
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
end:
0 for the start of bar, 1 for the end of bar.
Returns:
Returns the termination's (e.g. hook,crank) rotation angle at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2026

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.GetCrankTypeIdAtIndex(System.Int32,System.Int32)
Gets the id of the Rebar Crank Type that is applied to this Rebar at the bar with index barPositionIndex at the specified end.
Remarks:
If this Rebar has Workshop Instructions set to Straight will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetCrankTypeId(int end).
If this Rebar has Workshop Instructions set to Bent there are different cases:
All bars are matched exactly with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetCrankTypeId(int end).All bars are matched in reversed order with a shape. In this case will return the same value for all barPositionIndex between 0 and (NumberOfBarPositions-1). This value will be the same as Rebar.GetCrankTypeId(int end).Some bars are matched in reversed order and the others are matched exactly with a shape. In this case for bars that are matched reversed will return the id of the Rebar Crank Type at the opposite end. For the others bars will return the same as Rebar.GetCrankTypeId(int end).
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
end:
0 for the start hook, 1 for the end crank.
Returns:
The id of a Rebar Crank Type, or invalidElementId if the rebar has no crank at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
-or-
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2026

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsCustomSpacing(System.String)
Sets the Layout Rule property of rebar set to Custom Spacing.
customSpacingFormula:
The layout formula.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The specified formula is not valid (doesn't have a valid syntax).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2027

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsMinimumClearSpacing(System.Double)
Sets the Layout Rule property of rebar set to Minimum Clear Spacing.
spacing:
The maximum spacing of bars in set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The spacing isn't bigger than 0.0.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsMaximumSpacing(System.Double)
Sets the Layout Rule property of rebar set to Maximum Spacing.
spacing:
The maximum spacing of bars in set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The spacing isn't bigger than 0.0.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsFixedNumber(System.Int32)
Sets the Layout Rule property of rebar set to Fixed Number.
numberOfBars:
The number of bars in set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the number of bar positions numberOfBars is less than 1 or more than 1002.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.SetLayoutAsNumberWithSpacing(System.Int32,System.Double)
Sets the Layout Rule property of rebar set to Number With Spacing.
numberOfBars:
The number of bars in set.
spacing:
The spacing of bars in set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The spacing isn't bigger than 0.0.
-or-
the number of bar positions numberOfBars is less than 1 or more than 1002.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
Since:
2018

Autodesk.Revit.DB.Structure.RebarFreeFormAccessor.FreeFormSetOrientationOptions
Identifies the orientation options for an Aligned or 3D Path Free Form Rebar set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarFreeFormAccessor doesn't contain a valid rebar reference.
-or-
This RebarFreeFormAccessor Rebar is not created with the Aligned or 3D Path Free Form rebar server.
Since:
2027